# Pandas

## It is a library which handles dataframe
## dsa+math+stats+linalg
## used fr handling missing data

### excel==dataset
### rows*cols
### rows=records
### column == feature,variable,attribute

In [64]:
## in dataset we have either number or text
## number--numerical data
## text -- categorical data

In [65]:
import pandas as pd

In [66]:
import numpy as np

In [67]:
import matplotlib.pyplot as plt

In [68]:
import seaborn as sns

In [72]:
stats=pd.read_excel(r'C:\Users\91995\Downloads\data.xlsx')

In [73]:
stats

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [74]:
len(stats)

195

In [75]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [76]:
len(stats.columns)

5

In [77]:
stats.shape

(195, 5)

In [78]:
stats.isnull()

     CountryName  CountryCode  BirthRate  InternetUsers  IncomeGroup
0          False        False      False          False        False
1          False        False      False          False        False
2          False        False      False          False        False
3          False        False      False          False        False
4          False        False      False          False        False
..           ...          ...        ...            ...          ...
190        False        False      False          False        False
191        False        False      False          False        False
192        False        False      False          False        False
193        False        False      False          False        False
194        False        False      False          False        False

[195 rows x 5 columns]

In [79]:
stats.isna()

     CountryName  CountryCode  BirthRate  InternetUsers  IncomeGroup
0          False        False      False          False        False
1          False        False      False          False        False
2          False        False      False          False        False
3          False        False      False          False        False
4          False        False      False          False        False
..           ...          ...        ...            ...          ...
190        False        False      False          False        False
191        False        False      False          False        False
192        False        False      False          False        False
193        False        False      False          False        False
194        False        False      False          False        False

[195 rows x 5 columns]

In [80]:
stats.isnull().sum()

CountryName      0
CountryCode      0
BirthRate        0
InternetUsers    0
IncomeGroup      0
dtype: int64

In [81]:
stats.dtypes

CountryName       object
CountryCode       object
BirthRate        float64
InternetUsers    float64
IncomeGroup       object
dtype: object

In [82]:
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [83]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [84]:
stats.tail()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [85]:
stats.head(2)

   CountryName CountryCode  BirthRate  InternetUsers  IncomeGroup
0        Aruba         ABW     10.244           78.9  High income
1  Afghanistan         AFG     35.253            5.9   Low income

In [86]:
stats.tail(2)

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
193      Zambia         ZMB     40.471           15.4  Lower middle income
194    Zimbabwe         ZWE     35.715           18.5           Low income

In [87]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [88]:
stats['CountryName']

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

In [89]:
stats[:]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [90]:
stats['BirthRate']

0      10.244
1      35.253
2      45.985
3      12.877
4      11.044
        ...
190    32.947
191    20.850
192    42.394
193    40.471
194    35.715
Name: BirthRate, Length: 195, dtype: float64

In [91]:
stats[['BirthRate','InternetUsers']]

     BirthRate  InternetUsers
0       10.244           78.9
1       35.253            5.9
2       45.985           19.1
3       12.877           57.2
4       11.044           88.0
..         ...            ...
190     32.947           20.0
191     20.850           46.5
192     42.394            2.2
193     40.471           15.4
194     35.715           18.5

[195 rows x 2 columns]

In [92]:
# Lets split the dataset o numerical and categrical data

In [93]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [94]:
stats_numeric_data=stats[['BirthRate','InternetUsers']]

In [95]:
stats_numeric_data.head()

   BirthRate  InternetUsers
0     10.244           78.9
1     35.253            5.9
2     45.985           19.1
3     12.877           57.2
4     11.044           88.0

In [97]:
stats_categorical_data=stats[['CountryName','CountryCode','IncomeGroup']]

In [98]:
stats_categorical_data.head()

            CountryName CountryCode          IncomeGroup
0                 Aruba         ABW          High income
1           Afghanistan         AFG           Low income
2                Angola         AGO  Upper middle income
3               Albania         ALB  Upper middle income
4  United Arab Emirates         ARE          High income

In [99]:
stats[3:]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
5,Argentina,ARG,17.716,59.9,High income
6,Armenia,ARM,13.308,41.9,Lower middle income
7,Antigua and Barbuda,ATG,16.447,63.4,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [100]:
stats[::-2]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
194,Zimbabwe,ZWE,35.715,18.5,Low income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
188,West Bank and Gaza,PSE,30.394,46.6,Lower middle income
186,Vietnam,VNM,15.537,43.9,Lower middle income
...,...,...,...,...,...
8,Australia,AUS,13.200,83.0,High income
6,Armenia,ARM,13.308,41.9,Lower middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
2,Angola,AGO,45.985,19.1,Upper middle income
0,Aruba,ABW,10.244,78.9,High income

In [101]:
stats[50:100]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
50,Ecuador,ECU,21.070,40.353684,Upper middle income
51,"Egypt, Arab Rep.",EGY,28.032,29.400000,Lower middle income
52,Eritrea,ERI,34.800,0.900000,Low income
53,Spain,ESP,9.100,71.635000,High income
54,Estonia,EST,10.300,79.400000,High income
55,Ethiopia,ETH,32.925,1.900000,Low income
56,Finland,FIN,10.700,91.514400,High income
57,Fiji,FJI,20.463,37.100000,Upper middle income
58,France,FRA,12.300,81.919800,High income
59,"Micronesia, Fed. Sts.",FSM,23.511,27.800000,Lower middle income
60,Gabon,GAB,30.555,9.200000,Upper middle income
61,United Kingdom,GBR,12.200,89.844100,High income
62,Georgia,GEO,13.332,43.300000,Lower middle income
63,Ghana,GHA,33.131,12.300000,Lower middle income
64,Guinea,GIN,37.337,1.600000,Low income
65,"Gambia, The",GMB,42.525,14.000000,Low income
66,Guinea-Bissau,GNB,37.503,3.100000,Low income
67,Equatorial Guinea,GNQ,35.362,16.400000,High income
68,Greece,GRC,8.500,59.866300,High income
69,Grenada,GRD,19.334,35.000000,Upper middle income
70,Greenland,GRL,14.500,65.800000,High income
71,Guatemala,GTM,27.465,19.700000,Lower middle income
72,Guam,GUM,17.389,65.400000,High income
73,Guyana,GUY,18.885,35.000000,Lower middle income
74,"Hong Kong SAR, China",HKG,7.900,74.200000,High income
75,Honduras,HND,21.593,17.800000,Lower middle income
76,Croatia,HRV,9.400,66.747600,High income
77,Haiti,HTI,25.345,10.600000,Low income
78,Hungary,HUN,9.200,72.643900,High income
79,Indonesia,IDN,20.297,14.940000,Lower middle income
80,India,IND,20.291,15.100000,Lower middle income
81,Ireland,IRL,15.000,78.247700,High income
82,"Iran, Islamic Rep.",IRN,17.900,29.950000,Upper middle income
83,Iraq,IRQ,31.093,9.200000,Upper middle income
84,Iceland,ISL,13.400,96.546800,High income
85,Israel,ISR,21.300,70.800000,High income
86,Italy,ITA,8.500,58.459300,High income
87,Jamaica,JAM,13.540,37.100000,Upper middle income
88,Jordan,JOR,27.046,41.000000,Upper middle income
89,Japan,JPN,8.200,89.710000,High income
90,Kazakhstan,KAZ,22.730,54.000000,Upper middle income
91,Kenya,KEN,35.194,39.000000,Lower middle income
92,Kyrgyz Republic,KGZ,27.200,23.000000,Lower middle income
93,Cambodia,KHM,24.462,6.800000,Low income
94,Kiribati,KIR,29.044,11.500000,Lower middle income
95,"Korea, Rep.",KOR,8.600,84.770000,High income
96,Kuwait,KWT,20.575,75.460000,High income
97,Lao PDR,LAO,27.051,12.500000,Lower middle income
98,Lebanon,LBN,13.426,70.500000,Upper middle income
99,Liberia,LBR,35.521,3.200000,Low income